# SQLite Instance for Country Club Data Set #

In [55]:
#importing packages
import pandas as pd
from sqlalchemy import create_engine

In [53]:
#creating engine
engine = create_engine('sqlite:///sqlite_db_pythonsqlite.db')

In [58]:
#printing table names
table_names = engine.table_names()
print(table_names)

['Bookings', 'Facilities', 'Members']

### Q10: Produce a list of facilities with a total revenue less than 1000. The output of facility name and total revenue, sorted by revenue. Remember that there's a different cost for guests and members! ###

In [72]:
#creating DataFrame for Q10
df_revenue = pd.read_sql_query("select name, \
                                sum(case when memid = 0 then slots * guestcost else slots * membercost end) as revenue \
                                from Bookings \
                                left join Facilities \
                                using(facid) \
                                group by name \
                                having revenue < 1000;", engine)

In [73]:
df_revenue.head()

            name  revenue
0     Pool Table      270
1  Snooker Table      240
2   Table Tennis      180

In [68]:
df_bookings = pd.read_sql_query("select * from Bookings", engine)
df_bookings.head()

   bookid  facid  memid            starttime  slots
0       0      3      1  2012-07-03 11:00:00      2
1       1      4      1  2012-07-03 08:00:00      2
2       2      6      0  2012-07-03 18:00:00      2
3       3      7      1  2012-07-03 19:00:00      2
4       4      8      1  2012-07-03 10:00:00      1